DataProcessors/ПодготовкаКонфигурацииКПостроениюДереваВызоваПроцедур.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.0">
	<DataProcessor>
		<Properties>
			<Name>ПодготовкаКонфигурацииКПостроениюДереваВызоваПроцедур</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КаталогИсходныхФайлов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогСборки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаскиФайлов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогБазы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательБазы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеестрЗагружаемыхФайлов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КопируемыеФайлы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФайлИсточник</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФайлПриемник</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/ПодготовкаКонфигурацииКПостроениюДереваВызоваПроцедур/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ВыполнитьОбработкуНаСервере()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	МассивМасок = ОбработкаОбъект.РазложитьСтрокуВМассивПодстрок(Объект.МаскиФайлов, Символы.ПС);
	ОбработкаОбъект.СкопироватьФайлыОбъектовПоМассивуМасок(МассивМасок);
	ОбработкаОбъект.ПодставитьМеткиВФайлы(Объект.КаталогСборки);
	ОбработкаОбъект.СоздатьРеестрЗагружаемыхФайлов(Объект.КаталогСборки);
	ОбработкаОбъект.ЗагрузитьКонфигурациюИзФайлов(
						ОбработкаОбъект.КаталогБазы, 
						ОбработкаОбъект.ПользовательБазы,
						ОбработкаОбъект.КаталогСборки, 
						ОбработкаОбъект.РеестрЗагружаемыхФайлов);
	
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
	
	Сообщить("Готово");
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОбработку(Команда)
	ВыполнитьОбработкуНаСервере();
КонецПроцедуры

&НаКлиенте
Функция ПолучитьПутьККаталогу()
	
	ДиалогФыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	ДиалогФыбораФайла.Заголовок = "Выберите каталог";
	Если ДиалогФыбораФайла.Выбрать() Тогда
		Возврат ДиалогФыбораФайла.Каталог;
	КонецЕсли;	
	
КонецФункции

&НаКлиенте
Процедура КаталогНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ВыбранныйПуть = ПолучитьПутьККаталогу();
	Если ВыбранныйПуть = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект[Элемент.Имя] = ВыбранныйПуть;
КонецПроцедуры
